Tools/KeyExchange/1/KeyExchangeConfirm.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<m:Confirm xmlns:m="urn:schemas-microsoft-com:service:mstrustagreement:1">
			<HostID xmlns:dt="urn:schemas-microsoft-com:datatypes" dt:dt="string">uuid:e73681eb-1c62-4083-bd99-a1c408d30457</HostID>
			<IterationsRequired xmlns:dt="urn:schemas-microsoft-com:datatypes" dt:dt="ui1">4</IterationsRequired>
			<HostConfirmNonce xmlns:dt="urn:schemas-microsoft-com:datatypes" dt:dt="string">1yBUKJCx/ke1WzGCA6sfSO0L4c8=</HostConfirmNonce>
		</m:Confirm>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
